** Ejericio1


Considerar las siguientes definiciones de funciones:
1) Cuál es el tipo de cada función? (Suponer que todos los números son de tipo Float).

El tipo esta especificado dentro de cada funcion
max2 (x, y)
#+BEGIN_SRC haskell :results output
  :{
  max2:: (Float, Float) -> Float
  max2 (x, y) | x >= y = x
              | otherwise = y
  :}
  max2 (2, 4)
#+END_SRC

#+RESULTS:
: 4.0


normaVectorial (x, y)
#+BEGIN_SRC haskell :results output
  :{
  normaVectorial:: (Float, Float) -> Float
  normaVectorial (x, y) = sqrt (x^2 + y^2)
  :}
  normaVectorial (2, 2)
#+END_SRC

#+RESULTS:
: 2.828427

subtract
#+BEGIN_SRC haskell :results output
:{
subtract:: Float -> Float -> Float
subtract = flip (-)
:}
subtract 8 2
#+END_SRC

*RESULTS:*
: -6.0

predecesor
#+BEGIN_SRC haskell :results output
  :{
    subtract:: Float -> Float -> Float
     subtract = flip (-)

     predecesor:: Float -> Float
     predecesor = subtract 1

  :}
  predecesor 8
#+END_SRC

*RESULTS:*
: 7.0



evaluarEnCero

#+BEGIN_SRC haskell :results output
  :{
    subtract:: Float -> Float -> Float
    subtract = flip (-)

    predecesor:: Float -> Float
    predecesor = subtract 1

    evaluarEnCero:: (Float -> Float) -> Float
    evaluarEnCero = \f -> f 0

  :}
  evaluarEnCero(predecesor)
#+END_SRC

*RESULTS:*
: -1.0

dosVeces
#+BEGIN_SRC haskell :results output
  :{
    dosVeces:: (Float -> Float) -> (Float -> Float)
    dosVeces = \f -> f . f

    sumarDos:: Float -> Float
    sumarDos x = x + 2
  :}

   dosVeces sumarDos 5
#+END_SRC

*RESULTS:*
: 9.0

flipAll = map flip
#+BEGIN_SRC haskell :results output
  :{
     flipAll:: [a -> b -> c] -> [b -> a -> c]
     flipAll = map flip

  :}
#+END_SRC

*RESULTS:*




flipRaro = flip flip
#+BEGIN_SRC haskell :results output
  :{
    flipRaro:: e -> (d -> e -> f) -> d -> f
    flipRaro = flip flip

  :}
#+END_SRC

*RESULTS:*

ii. Indicar cuáles de las funciones anteriores no están curricadas. Para cada una de ellas, denir la función
curricada correspondiente. Recordar dar el tipo de la función.
*** sum
#+begin_src haskell :results output
    :{
    sum:: Num b => [b] -> b
    sum [] = 0
    sum (b:bs) = b + sum bs
    :}

    :{
    sumF::Num b => [b] -> b
    sumF = foldr (\x resRec -> x + resRec )  0
    :}
  sumF [1, 2, 3]

#+end_src

#+RESULTS:
: 6
*** Map
#+begin_src haskell :results output
  :{
     map::
  :}

#+end_src

#+RESULTS:
: map :: (a -> b) -> [a] -> [b]

ii. Definir la función mejorSegún :: (a -> a -> Bool) -> [a] -> a, que
devuelve  el máximo elemento de la lista según una función de
comparación, utilizando foldr1. Por ejemplo, maximum = mejorSegún (>).
